CSI API ETABS v1
eFileTypeIO Enumeration
 The possible file types for import and export.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eFileTypeIO
Public Enumeration eFileTypeIO
Dim instance As eFileTypeIO
public enum class eFileTypeIO
type eFileTypeIO
Members
Member name | Value | Description
TextFile | 1
DBTablesExcel | 2
DBTablesAccess | 3
DBTablesText | 4
DBTablesXML | 5
Remarks
See Also
Reference
ETABSv1 Namespace